package ex02_class;

public class Ex01_class {

	public static void main(String[] args) {
		Car car = new Car();
		// 메서드의 사용
		// 구현된 메서드를 사용하는 방법은 필드의 사용법과 동읾
		// 메서드를 선언한 클래스 안에서 메서드를 사용할 때는 단순히 메서드명만 호출하면 되지만,
		// 다른 클래스에서 메서드를 사용하려면 객체를 생성한 후 참조 변수를 이용해 그 객체의 메서드를 사용해야 한다.
		// 객체가 존재해야 메서드도 존재하기 때문이다.
		
		//변수명.메서드명(); 생성한 객체의 메서드 호출
		
		car.ride();
		
		// 함수의 작동원리
		//메서드를 호출하면 흐름이 선언된 쪽으로 간다.
		//내부에 있는 코드들이 순차적으로 실행
		//경우에 따라 실행한 결과를 호출한곳으로 돌려준다.
		//값을 돌려주는 것을 '반환한다'라고 표현하고, 반환하는 결과값을 '반환값'이라고 한다.
		//반환값이 있는 경우 반환하는 데이터의 타입을 반환형에 명시헤야 한다. 
		//int boolean 등 기본자료형과 String같은 참조자료형도 가능하지만 사용자가 만든 객체로도 반환이 가능하다.
		//아무것도 반환하지 않을때는 void
		
		//메서드 이름짓기
		//기능을 명확하게 설명해줄 수 있게 작성
		//메서드명을 작성하는 규칙은 변수를 작성하는 규칙과 동일하다.
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		

	}

}
